#### [`repos`] Terraform Plan 📖`success`



<details><summary>Show Plan</summary>

```tf
github_repository.cdktn-provider-newrelic-go_repo_F92A5D4E: Preparing import... [id=cdktn-provider-newrelic-go]
data.github_team.cdktn-team-cdk-terrain: Reading...
data.github_team.cdktn-team-cdk-terrain: Read complete after 7s [id=15746607]
github_repository.cdktn-provider-newrelic_repo_937BA5B7: Preparing import... [id=cdktn-provider-newrelic]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_secret.cdktn-provider-newrelic_repo_secret-alert-prs-slack-webhook-url_18A27636 will be created
  + resource "github_actions_secret" "cdktn-provider-newrelic_repo_secret-alert-prs-slack-webhook-url_18A27636" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-newrelic"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-newrelic_repo_secret-gh-app-id-alias-PROJEN_APP_ID_0CF16B71 will be created
  + resource "github_actions_secret" "cdktn-provider-newrelic_repo_secret-gh-app-id-alias-PROJEN_APP_ID_0CF16B71" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-newrelic"
      + secret_name     = "PROJEN_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-newrelic_repo_secret-gh-app-id_CD9020F9 will be created
  + resource "github_actions_secret" "cdktn-provider-newrelic_repo_secret-gh-app-id_CD9020F9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-newrelic"
      + secret_name     = "GH_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-newrelic_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_191B2A61 will be created
  + resource "github_actions_secret" "cdktn-provider-newrelic_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_191B2A61" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-newrelic"
      + secret_name     = "PROJEN_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-newrelic_repo_secret-gh-app-private-key_2C9AC7D8 will be created
  + resource "github_actions_secret" "cdktn-provider-newrelic_repo_secret-gh-app-private-key_2C9AC7D8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-newrelic"
      + secret_name     = "GH_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-newrelic_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_47573B58 will be created
  + resource "github_actions_secret" "cdktn-provider-newrelic_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_47573B58" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-newrelic"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-newrelic_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_02B4F427 will be created
  + resource "github_actions_secret" "cdktn-provider-newrelic_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_02B4F427" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-newrelic"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-newrelic_repo_secret-gh-token_977646B8 will be created
  + resource "github_actions_secret" "cdktn-provider-newrelic_repo_secret-gh-token_977646B8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-newrelic"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-newrelic_repo_secret-npm-token_F8FABC5E will be created
  + resource "github_actions_secret" "cdktn-provider-newrelic_repo_secret-npm-token_F8FABC5E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-newrelic"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-newrelic_repo_secret-twine-password_5E99234B will be created
  + resource "github_actions_secret" "cdktn-provider-newrelic_repo_secret-twine-password_5E99234B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-newrelic"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-newrelic_repo_secret-twine-username_43DD5C98 will be created
  + resource "github_actions_secret" "cdktn-provider-newrelic_repo_secret-twine-username_43DD5C98" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-newrelic"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.cdktn-provider-newrelic_repository-setup_main-protection_BFFC09BD will be created
  + resource "github_branch_protection" "cdktn-provider-newrelic_repository-setup_main-protection_BFFC09BD" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktn-provider-newrelic"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-go",
              + "package-js",
              + "package-python",
            ]
          + strict   = false
        }
    }

  # github_issue_label.cdktn-provider-newrelic-go_repository-setup_auto-approve-label_D8B686B4 will be created
  + resource "github_issue_label" "cdktn-provider-newrelic-go_repository-setup_auto-approve-label_D8B686B4" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-newrelic-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-newrelic-go_repository-setup_automerge-label_A38E4AE3 will be created
  + resource "github_issue_label" "cdktn-provider-newrelic-go_repository-setup_automerge-label_A38E4AE3" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-newrelic-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-newrelic-go_repository-setup_no-auto-close-label_49D96E15 will be created
  + resource "github_issue_label" "cdktn-provider-newrelic-go_repository-setup_no-auto-close-label_49D96E15" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-newrelic-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-newrelic_repository-setup_auto-approve-label_082662BD will be created
  + resource "github_issue_label" "cdktn-provider-newrelic_repository-setup_auto-approve-label_082662BD" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-newrelic"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-newrelic_repository-setup_automerge-label_EA8D6E63 will be created
  + resource "github_issue_label" "cdktn-provider-newrelic_repository-setup_automerge-label_EA8D6E63" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-newrelic"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-newrelic_repository-setup_no-auto-close-label_5F2AE930 will be created
  + resource "github_issue_label" "cdktn-provider-newrelic_repository-setup_no-auto-close-label_5F2AE930" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-newrelic"
      + url        = (known after apply)
    }

  # github_repository.cdktn-provider-newrelic-go_repo_F92A5D4E will be updated in-place
  # (imported from "cdktn-provider-newrelic-go")
  ~ resource "github_repository" "cdktn-provider-newrelic-go_repo_F92A5D4E" {
      ~ allow_auto_merge            = false -> true
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      ~ allow_update_branch         = false -> true
      + archive_on_destroy          = true
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "CDK Terrain Go provider bindings for newrelic."
        etag                        = "W/\"881d1e8bb0cfdd3a0351364a28e630f9ad01bb80c5a2d2b0c422bff9ee257a8c\""
        full_name                   = "cdktn-io/cdktn-provider-newrelic-go"
        git_clone_url               = "git://github.com/cdktn-io/cdktn-provider-newrelic-go.git"
        has_discussions             = false
      - has_downloads               = true -> null
      ~ has_issues                  = true -> false
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
      + homepage_url                = "https://cdktn.io"
        html_url                    = "https://github.com/cdktn-io/cdktn-provider-newrelic-go"
        http_clone_url              = "https://github.com/cdktn-io/cdktn-provider-newrelic-go.git"
        id                          = "cdktn-provider-newrelic-go"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "cdktn-provider-newrelic-go"
        node_id                     = "R_kgDORVdGOw"
        primary_language            = "Go"
        private                     = false
        repo_id                     = 1163347515
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        ssh_clone_url               = "git@github.com:cdktn-io/cdktn-provider-newrelic-go.git"
        svn_url                     = "https://github.com/cdktn-io/cdktn-provider-newrelic-go"
      ~ topics                      = [
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "newrelic",
          + "opentofu",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
        visibility                  = "public"
      ~ vulnerability_alerts        = true -> false
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.cdktn-provider-newrelic_repo_937BA5B7 will be updated in-place
  # (imported from "cdktn-provider-newrelic")
  ~ resource "github_repository" "cdktn-provider-newrelic_repo_937BA5B7" {
      ~ allow_auto_merge            = false -> true
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      ~ allow_update_branch         = false -> true
      + archive_on_destroy          = true
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "Prebuilt CDK Terrain (cdktn) provider for newrelic."
        etag                        = "W/\"02cd9e3e8b29409b1e8831fd73ffb45f3d79df91fb2cb8e93d2d8875d2445647\""
        full_name                   = "cdktn-io/cdktn-provider-newrelic"
        git_clone_url               = "git://github.com/cdktn-io/cdktn-provider-newrelic.git"
        has_discussions             = false
      - has_downloads               = true -> null
        has_issues                  = true
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
      + homepage_url                = "https://cdktn.io"
        html_url                    = "https://github.com/cdktn-io/cdktn-provider-newrelic"
        http_clone_url              = "https://github.com/cdktn-io/cdktn-provider-newrelic.git"
        id                          = "cdktn-provider-newrelic"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "cdktn-provider-newrelic"
        node_id                     = "R_kgDORVdFIw"
        primary_language            = "TypeScript"
        private                     = false
        repo_id                     = 1163347235
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        ssh_clone_url               = "git@github.com:cdktn-io/cdktn-provider-newrelic.git"
        svn_url                     = "https://github.com/cdktn-io/cdktn-provider-newrelic"
      ~ topics                      = [
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "newrelic",
          + "opentofu",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository_dependabot_security_updates.cdktn-provider-newrelic_dependabot-security_50F6650B will be created
  + resource "github_repository_dependabot_security_updates" "cdktn-provider-newrelic_dependabot-security_50F6650B" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "cdktn-provider-newrelic"
    }

  # github_repository_webhook.cdktn-provider-newrelic-go_repository-setup_slack-webhook_7A97B5A0 will be created
  + resource "github_repository_webhook" "cdktn-provider-newrelic-go_repository-setup_slack-webhook_7A97B5A0" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-newrelic-go"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.cdktn-provider-newrelic_repository-setup_slack-webhook_E645910A will be created
  + resource "github_repository_webhook" "cdktn-provider-newrelic_repository-setup_slack-webhook_E645910A" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-newrelic"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_team_repository.cdktn-provider-newrelic-go_repository-setup_managing-team_B6223F5C will be created
  + resource "github_team_repository" "cdktn-provider-newrelic-go_repository-setup_managing-team_B6223F5C" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-newrelic-go"
      + team_id    = "15746607"
    }

  # github_team_repository.cdktn-provider-newrelic_repository-setup_managing-team_4A04B4A1 will be created
  + resource "github_team_repository" "cdktn-provider-newrelic_repository-setup_managing-team_4A04B4A1" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-newrelic"
      + team_id    = "15746607"
    }

Plan: 2 to import, 23 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ providerRepos   = [
        # (15 unchanged elements hidden)
        "github_repository.cdktn-provider-local_repo_5CE00778.ssh_clone_url",
      + "github_repository.cdktn-provider-newrelic_repo_937BA5B7.ssh_clone_url",
        "github_repository.cdktn-provider-null_repo_41CFF515.ssh_clone_url",
        # (6 unchanged elements hidden)
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @team-cdk-terrain[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*